---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarHandleType.CustomHandle
enum: Autodesk.Revit.DB.Structure.RebarHandleType
source: html/0773859c-5f30-3fb4-25b3-34c80432aaa4.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleType.CustomHandle

Custom handle used in API constraints. The handle itself and the behavior of this type of handle
 is defined in the API (see IRebarUpdateServer ).
 This handle defines a symbolic part of the rebar
 and is not tied to a specific segment or part of the rebar.
 Handles that represent the start and end of a bar should not be of this type.